Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/types_of_employment/self_employment/coming_to_set_up_a_business_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Coming to set up a business or invest in Ireland
ga: Teacht go hÉirinn le infheistiú nó gnó a chur ar bun

source: • Schemes for self-employed non-EEA nationals
ga: • Scéimeanna do náisiúnaigh neamh-LEE féinfhostaithe

source: If you are an EEA or Swiss national you are entitled to come and work in Ireland either as an employed or a self-employed person
ga: Más saoránach den LEE nó den Eilvéis thú, tá tú i dteideal teacht ag obair go hÉirinn mar fhostaí nó mar dhuine féinfhostaithe

source: EEA and Swiss nationals do not require a business permission to establish a business in Ireland and they do not require a visa to visit, travel to, live or work in Ireland
ga: Ní chaithfidh saoránaigh an LEE ná na hEilvéise cead gnó a bheith acu le gnó a bhunú in Éirinn, ná víosa le cuairt a thabhairt ar Éirinn, taisteal go hÉirinn ná maireachtáil nó oibriú in Éirinn

source: Non-EEA nationals can establish a business in Ireland but they require permission to do so
ga: Féadfaidh daoine nach saoránaigh den LEE iad gnó a bhunú in Éirinn ach caithfidh siad cead a bheith acu

source: There are 3 ways in which non-EEA nationals can invest or start a business in Ireland – see ‘Schemes for self-employed non-EEA nationals’ below
ga: Tá 3 bealach do náisiúnaigh neamh-LEE chun infheistíocht a dhéanamh nó gnó a chur ar bun in Éirinn – féach ‘Scéimeanna do náisiúnaigh neamh-LEE féinfhostaithe’ thíos

source: If you are coming from outside Ireland to set up a business you will need information on a number of topics such as tax and legal requirements – see ‘Information and supports’ below
ga: Má tá tú ag teacht as an gcoigríoch le gnó a bhunú Éirinn, beidh faisnéis ag teastáil uait faoi raon ábhar, ar nós cánacha agus riachtanas dlíthiúil - féach 'Tacaíochtaí faisnéise' thíos

source: Schemes for self-employed non-EEA nationals
ga: Scéimeanna do náisiúnaigh neamh-LEE féinfhostaithe

source: The Immigrant Investor Programme provides a range of investment options which allows approved non-EEA investors and their immediate family enter Ireland on multi-entry visas and remain here for up to 5 years with the possibility of ongoing renewal
ga: Cuireann an Clár Infheisteoir Inimircigh roghanna infheistíochta ar fáil a ligfidh d’infheisteoirí faofa neamh-LEE agus lena neasteaghlach Éire a iontráil ar víosaí iliontrála agus fanacht anseo ar feadh a mhéid agus 5 bliana agus d’fhéadfaí athnuachan leanúnach a cheadú dóibh

source: The investment must be good for Ireland, good for jobs and in the public interest
ga: Ní mór go rachaidh an infheistíocht chun socair na hÉireann, chun socair post agus ní mór di bheith chun leasa poiblí

source: The funds must be legally acquired and owned, not borrowed, by the investor
ga: Ní mór na cistí a fháil ar bhealach dlíthiúil agus ní mór go mbíonn siad faoi úinéireacht an infheisteora, seachas iad a fháil ar iasacht

source: In order to be considered for the Programme, the proposed investment must be in one of the following categories
ga: D’fhonn go ndéanfaí breithniú ort don Chlár, ní mór go mbeadh an infheistíocht bheartaithe i gceann amháin de na catagóirí a leanas:

source: • Endowment: €500,000 to a public project benefiting the arts, sports, health, culture or education. The endowment can be €400,000 per investor if it is pooled by at least 5 individuals
ga: • Maoiniú: Ar a laghad €500,000 do thionscadal poiblí a théann chun sochair na n-ealaíon, an spóirt, na sláinte, an chultúir nó an oideachais

source: • Enterprise Investment: In 2017 a minimum €1 million (was 500,000) aggregate investment into new or existing Irish businesses for a minimum of 3 years
ga: • Infheistíocht Fiontraíochta: I 2017 comhiomlán €1 milliún (€500,000 roimhe sin) ar a laghad a dhéanamh isteach i ngnólachtaí nua nó reatha ar feadh 3 bliana ar a laghad

source: • Immigrant Investor Bonds: A minimum €1,000,000 investment in a 5-year immigrant investor bond (suspended since 18 July 2016)
ga: • Bannaí Infheisteoir Imircigh: Infheistíocht €1,000,000 ar a laghad a dhéanamh isteach i mbanna infheisteoir imircigh 5 bliana (curtha ar fionraí ó 20 Iúil 2016)

source: • Mixed Investment: A minimum €450,000 in property and €500,000 in immigrant investor bonds (suspended since 18 July 2016)
ga: • Infheistíocht Mheasctha: Ina dtéann €450,000 chun réadmhaoine agus €500,000 chun bannaí infheisteoir imircigh (curtha ar fionraí ó 20 Iúil 2016)

source: • Investment Fund: A minimum of €1 million (was €500,000) in an approved investment fund which would invest in Irish businesses and projects
ga: • Ciste Infheistíochta: I 2017 €1 milliún (€500,000 roimhe seo) ar a laghad a dhéanamh isteach i gciste infheistíochta faofa a infheisteoidh i ngnóthaí agus tionscadail Éireannacha

source: • Real Estate Investment Trust (REIT): A minimum investment of €2 million in any Irish REIT listed on the Irish Stock Exchange
ga: • Iontaobhas Infheistíochta Eastáit Réadaigh (IIER): Infheistíocht €2,000,000 ar a laghad a dhéanamh isteach in aon IIER atá liostaithe sa Stocmhalartán Éireannach

source: The investment may be spread across a number of Irish REITs
ga: Is féidir an infheistíocht bheith scartha amach trasna méid IIER Éireannacha

source: You can read more information in the Immigrant Investor Programme Guidelines (pdf)
ga: Is féidir leat níos mó faisnéise a fháil i dTreoirlínte an Chláir Infheisteoir Imircigh (pdf)

source: The Start-up Entrepreneur Programme (STEP) allows a non-EEA national with an innovative business idea and minimum funding of €50,000 to come and set up a business in Ireland
ga: Ligfidh an Clár Tionscnaimh d’Fhiontraithe ligfidh sé do rannpháirtithe neamh-LEE ag a bhfuil togra nuálach gnó mar aon le cistiú nó tacaíocht airgeadais ar a laghad €50,000 teacht anseo agus gnó a bhunú in Éirinn

source: The aim of the Programme is to support High Potential Start-Ups which are defined as start-up ventures that are:
ga: Is í aidhm an Chláir tacú le Gnólachtaí Nuathionscanta Ardchumais a shainmhínítear amhail fiontair nuathionscanta faoi réir na gcritéar a leanas:

source: • Introducing a new or innovative product or service to international markets
ga: • Táirge nó seirbhís nua nó nuálaíoch a thabhairt isteach i margaí idirnáisiúnta

source: • Capable of creating 10 jobs in Ireland and realising €1 million in sales within three to four years of starting up
ga: • Bheith in ann 10 bpost a chruthú in Éirinn agus €1 milliún a réadú i ndíolacháin laistigh de thrí nó ceithre bliana tar éis tús a chur leis an ngnólacht

source: • Led by an experienced management team
ga: • Bheith faoi stiúir foireann thaithíoch bainistíochta

source: • Headquartered and controlled in Ireland
ga: • Go mbíonn ceanncheathrú an ghnólachta lonnaithe in Éirinn agus go mbíonn sé á rialú in Éirinn

source: • Less than 6 years old
ga: • Níos lú ná 6 bliana d’aois

source: New 12-month immigration permission: From 15 March 2014 a 12-month immigration permission will be available for foreign national entrepreneurs attending incubators or innovation bootcamps in Ireland to allow them to prepare a STEP application
ga: Cead inimirce 12 mhí nua: Ó 15 Márta 2014 beidh cead inimirce 12 mhí ar fáil d’fhiontraithe náisiúnaigh choigríche atá ag freastal gorlann nó grodchúrsaí nuálaíochta in Éirinn chun iarratas ar CTI a ullmhú

source: This 12-month permission will also be made available to non-EEA students who graduate with advanced STEM (Science, Technology, Engineering, and Mathematics) degrees in Ireland and wish to work on preparing a STEP application
ga: Cuirfear an cead 12 mhí ar fáil do mhic léinn neamh-LEE a ghrádaíonn le ETIM ardchéime (Eolaíocht, Teicneolaíocht, Innealtóireacht agus Matamaitic) gur mian leo oibrigh ar ullmhú iarratais CTI

source: The STEP scheme does not apply to retail, catering, personal services or similar businesses - see 'Business permission' below
ga: Ní bhaineann an scéim seo le miondíol, lónadóireacht, seirbhísí pearsanta nó lena mhacasamhail de ghnólachtaí – féach ‘Cead gnó’ thíos

source: No initial job creation targets will be set as it is recognised that such businesses can take some time to get off the ground
ga: Ní shocrófar aon spriocanna tosaigh um chruthú post de bharr go n-aithnítear go bhféadfadh sé roinnt ama a ghlacadh chun tús a chur leis na gnólachtaí sin

source: There is detailed information in the Start-up Entrepreneur Programme Guidelines (pdf)
ga: Tá fáil ar shonraí sonracha i dTreoirlínte an Chláir Fiontraí Nuathionscanta (pdf)

source: If you are not eligible for the Start-up Entrepreneur Programme or if you wish to start a retail, catering, personal services or similar business you should apply for a business permission
ga: Mura mbíonn tú i dteideal an Clár Tionscnaimh d’Fhiontraithe nó más mian leat gnó miondíola, lónadóireachta, seirbhísí pearsanta nó gnóthaí dá samhail a bhunú, caithfidh tú iarratas a dhéanamh ar an scéim cead gnó

source: This is a written permission from the Minister for Justice and Equality that allows you to establish and engage in a business in Ireland for a certain period
ga: Is éard atá i gcead gnó cead scríofa a thugann an tAire Dlí agus Cirt agus Comhionannais duit gnó a bhunú agus dul ina bhun in Éirinn ar feadh tréimhse áirithe

source: Since 16 March 2016 the business permission scheme has been suspended while the business, start-up entrepreneur and immigrant investor schemes are being reviewed
ga: Ó 16 Márta 2016, cuirtear an scéim cead gnó ar fionraí fad a dhéantar athbhreithniú ar na scéimeanna gnó, tionscnaimh d’fhiontraithe agus infheisteoir inimircigh

source: Applications for the scheme received before 16 March 2016 are not affected
ga: Ní théann sé i bhfeidhm ar iarratais glactha roimh 16 Márta 2016

source: If you are applying for a business permission to start a business in Ireland, you must meet the following strict criteria:
ga: Caithfidh tú critéir áirithe a chomhlíonadh le go bhféadfaidh tú cur isteach ar chead gnó mar a leanas:

source: • You must have at least €300,000 of your own money to invest in business in Ireland
ga: • Caithfidh tú €300,000 ar a laghad a bheith agat chun sa ghnó in Éirinn a infheistigh

source: • Your business must create employment for at least 2 Irish or EEA or Swiss nationals or at least maintain employment in an existing business
ga: • Caithfidh do ghnó fostaíocht a chur ar fáil do 2 saoránach d'Éirinn nó den LEE/Eilvéis ar a laghad nó ar a laghad an fhostaíocht a chaomhnú i ngnó atá cheana ann

source: • Your business must add to the commercial activity and competitiveness of the State
ga: • Caithfidh do ghnó a chur le gníomhaíocht tráchtála agus le cumas iomaíochta an Stáit

source: • Your business must be a viable trading concern and provide you with sufficient income to maintain and accommodate yourself and any dependants without resorting to social assistance or paid employment for which a General Employment Permit would be required
ga: • Caithfidh an gnó a bheith inmharthana mar ghnóthas tráchtála agus ioncam a chur ar fáil duit a chothóidh tú féin agus aon chleithiúnaí agat gan a bheith i dtuilleamaí cúnaimh shóisialaigh nó fostaíochta ar phá a mbeadh Cead Fostaíochta Ginearálta riachtanach di

source: Artists, writers or crafts people do not have to meet the capital and employment requirements
ga: Ealaíontóirí agus scríbhneoirí: Ní bheidh feidhm ag na rialacha faoi fhostaíocht nó chaipiteal má tá más ealaíontóir, scríbhneoir nó ceardaí thú

source: However they must show that they are well known in their field and that they can support themselves without the need for other employment or social assistance
ga: Caithfidh tú taispeáint go mbíonn tú aithnidiúil agus ábalta chun tú féin a chothú gan a bheith i dtuilleamaí cúnaimh shóisialaigh nó fostaíochta eile

source: In these cases they should contact the Department of Justice and Equality separately
ga: Sa chás seo ba cheart duit teagmháil ar leith a dhéanamh leis an Roinn Dlí agus Cirt agus Comhionannais

source: Successful applicants for the Immigrant Investor Programme and the Start-up Entrepreneur Programme and their immediate families will be granted residence permission for 2 years initially
ga: Bronnfar cead cónaitheachta ar iarratasóirí rathúla ar an gClár Infheisteoir Imircigh agus ar an gClár Fiontraí Nuathionscanta agus bronnfar cead cónaitheachta ar neasteaghlaigh a mhairfidh 2 bhliain i dtús báire

source: Their immediate family means their spouse, civil partner or partner and dependent children aged under 18
ga: Ciallaíonn a neasteaghlaigh a gcéile, a bpáirtnéir sibhialta nó a bpáirtnéir agus a gcleithiúnaithe linbh atá faoi 18 mbliana d’aois

source: This permission can be renewed for a further 3 years
ga: Is féidir an cead seo a athnuachan le haghaidh 3 bliana sa bhreis

source: After these first 5 years, the investor or entrepreneur can apply for long-term residence
ga: Má theastaíonn sé, bronnfar víosaí iliontrála don fhad céanna

source: If required they will be granted multiple entry visas for the same duration
ga: De ghnáth, tugtar cead gnó le haghaidh bliana amháin ar dtús

source: Usually, a business permission is granted for 1 year initially.Non-EEA nationals who are granted a business permission are entitled to live in Ireland for the duration of the business permission
ga: Tá daoine nach saoránaigh den LEE iad ach a bhfuil cead faoin na scéimeanna seo acu i dteideal maireachtáil in Éirinn chomh fada is a mhaireann an cead seo

source: They should check if they require a visa to enter Ireland
ga: Ba chóir dóibh seiceáil má theastaíonn víosa le teacht go hÉirinn

source: If you are coming from outside Ireland to set up a business you will need information on a number of topics such as tax and legal requirements
ga: Má tá tú ag teacht as an gcoigríoch le gnó a bhunú Éirinn, beidh faisnéis ag teastáil uait faoi raon ábhar, ar nós cánacha agus riachtanas dlíthiúil

source: You can find information about starting a business and being self-employed on this website, including details of legal structures and potential liabilities
ga: Féadfaidh tú faisnéis a fháil faoi ghnó a bhunú agus faoin a bheith féinfhostaithe ar an láithreán gréasáin seo, faisnéis a áireoidh mionsonraí faoi na struchtúir dhlíthiúla agus na dliteanais a d'fhéadfadh a bheith i gceist

source: You can read about the organisations, websites and publications that can help you in our document, Sources of information on starting a business
ga: Is féidir léigh tuilleadh faoi na heagraíochtaí, suímh agus foilseacháin chun cabhrú leat inár ndoiciméad, Foinsí faisnéise maidir le gnó a chur ar bun

source: The guide to self-employment, Toil and Trouble (pdf), is available on the Department of Social Protection website
ga: Tá an treoirleabhar Toil and Trouble (pdf) ar fáil ar láithreán gréasáin na Roinne Coimirce Sóisialaí

source: Businessregulation.ie is a portal to help you identify the main regulations which affect your business
ga: Is tairseach é businessregulation.ie a chabhraíonn leat na príomhrialacháin a chuireann ar do ghnó a sainaithin

source: If you are self-employed and your income is reduced you can find out more in our document on self employment and unemployment
ga: Má tá féinfhostaithe agus má cuireann tú gnó ar bun, tá faisnéis inár ndoiciméad faoi féinfhostaíocht agus dífhostaíocht

source: IDA (Irish Development Authority) Ireland is an Irish government agency with responsibility for securing new investment from overseas in manufacturing and internationally traded services sectors
ga: Gníomhaireacht de chuid Rialtas na hÉireann é an UFT (Údarás Forbartha Tionscail) a bhfuil de chúram air infheistíocht nua a chur á déanamh in Éirinn ón gcoigríoch, sa déantúsaíocht agus in earnálacha na seirbhísí a thrádáiltear go hidirnáisiúnta

source: It can provide information about setting up a business in Ireland and may provide grants to companies wishing to locate in Ireland or expand their existing operations in Ireland
ga: Féadfaidh sé faisnéis a chur ar fáil faoi ghnó a bhunú in Éirinn agus b'fhéidir go mbeadh deontais le fáil uaidh ag cuideachtaí atá ag iarraidh lonnú in Éirinn nó na hoibríochtaí atá acu cheana a mhéadú

source: Enterprise Ireland is an Irish government agency which is responsible for the development of Irish industry
ga: Gníomhaireacht de Rialtas na hÉireann is iad Fiontar Éireann atá freagrach as forbairt thionscal na hÉireann

source: It provides advice and financial support to High Potential Start-Up (HPSU) businesses
ga: Cuireann siad comhairle agus tacaíocht airgeadais ar fáil do ghnólachtaí Tosú Ardacmhainne (HPSUanna)

source: You can find information about starting a business in Ireland on its website
ga: Is féidir leat faisnéis a fháil faoi ghnó a chur ar bun in Éirinn ar a láithreán gréasáin

source: Local Enterprise Offices provide supports such as advice and grants to local businesses (10 or fewer employees) that are starting up or in development
ga: Tugann Oifigí Fiontair Áitiúla an tacaí, comhairle agus deontais mar shampla, do ghnóthais áitiúla (10 bhfostaí nó níos lú) atá á mbunú nó á bhforbairt

source: You can find information about their training programmes and start your own business courses as well as mentoring and financial supports on localenterprise.ie
ga: Tá faisnéis maidir le cláir oiliúna agus cúrsaí faoi do ghnó a chur ar bun, chomh maith le meantóireacht agus tacaíochtaí airgeadais ar fáil ar localenterprise.ie

source: Investor and entrepreneur programmes
ga: Cláir infheisteora agus fiontraí

source: To apply for the Immigrant Investor Programme you complete the investor application form (pdf) and pay a non-refundable application fee of €1500
ga: Chun iarratas a dhéanamh ar an gClár Infheisteoir Imircigh, déanann tú an fhoirm iarratais infheisteora (pdf) a chomhlánú agus íocann tú táille iarratais €1500 nach n-aisíoctar

source: To apply for the Start-up Entrepreneur Programme you complete the entrepreneur application form (pdf) and pay a non-refundable application fee of €350
ga: Chun iarratas a dhéanamh ar an gClár Nuathionscanta Fiontraí, déanann tú an fhoirm iarratais d’fhiontraithe (pdf) a chomhlánú agus íocann tú táille iarratais €350 nach n-aisíoctar

source: The application forms and guidelines as well as a sample business plan template are available on the INIS website
ga: Tá na foirmeacha iarratais agus na treoirlínte mar aon le teimpléad samplach um plean gnó ar fáil ar an suíomh gréasáin SEIÉ

source: • Your passport and those of your spouse/partner and dependants (if applicable)
ga: • Do phas agus pasanna do chéile/pháirtnéara agus do chleithiúnaithe (más infheidhme)

source: • Evidence of family relationships (if applicable)
ga: • Fianaise i leith caidreamh teaghlaigh (más infheidhme)

source: • Evidence of investment or details of start-up
ga: • Fianaise i leith infheistíochtaí nó sonraí i leith an nuathionscanta

source: • Police report or character report from risk management consultancy for yourself and for your spouse or partner (if applicable)
ga: • Tuairisc ó na Gardaí nó tuairisc charachtair ó chomhairleacht bainistithe riosca duit féin agus do do chéile/pháirtnéir (más infheidhme)

source: More information about the investor and entrepreneur programmes is available on inis.gov.ie
ga: Tá tuilleadh eolais faoi scéimeanna d’infheisteora agus fiontraí ar fáil ar inis.gov.ie

source: You apply for business permission to the Business Permission Unit of the Immigration Division of the Irish Naturalisation and Immigration Service – see ‘Where to apply’ below
ga: Cuirfear isteach ar chead gnó chun Aonad Cead Gnó Rannán Inimirce Sheirbhís Eadóirseachta agus Inimirce na hÉireann – féach ‘Cá háit a dhéanfaidh mé iarratas’ anseo thíos

source: Since 16 March 2016, the business permission scheme has been suspended
ga: Ó 16 Márta 2016, cuirtear an scéim cead gnó ar fionraí fad a dhéantar athbhreithniú ar na scéimeanna gnó, tionscnaimh d’fhiontraithe agus infheisteoir inimircigh

source: You must include the following documents:
ga: Ní mór duit na cáipéisí seo a leanas a chur le d'iarratas:

source: • Your valid passport or national identity document
ga: • Do phas nó doiciméad aitheantais náisiúnta bailí

source: • Your registration certificate if you are already residing in the State
ga: • Do theastas cláraithe má tá tú cheana i do chónaí sa Stát

source: • A statement of character from the police authorities of each country in which you have resided for more than 6 months during the previous 10 year period
ga: • Ráiteas carachtair ó údaráis phóilíneachta gach tíre ina raibh tú i do chónaí le breis agus 6 mhí, le 10 mbliana anuas

source: • A business plan which addresses the above criteria for a business permission
ga: • Plean gnó a fhreagraíonn do na critéir thuasluaite i dtaca le cead gnó

source: The plan should be endorsed by a firm of accountants or other relevant professionals
ga: Níor mhór an plean a bheith faofa ag gnóthas cuntasóirí nó ag a leithéidí eile de phroifisiúnaigh

source: • Details of your skills and qualifications to undertake this business
ga: • Sonraí do scileanna agus cháilíochtaí chun an gnó a ghealladh

source: • Original documents from your financial institution confirming you have at least €300,000 to invest in the business
ga: • Doiciméid bunaidh ó d'institiúid airgeadais mar dheimhniú go mbíonn €300,000 agat chun sa ghnó in Éirinn a infheistigh

source: • Details of where the business will operate
ga: • Sonraí na háite ina mbeidh an gnó

source: Contact the Companies Registration Office to register your business - see 'Where to apply' below
ga: Téigh i dteagmháil leis an Oifig um Chlárú Cuideachtaí chun do ghnó a chlárú - féach 'Cá háit a ndéanfaidh mé iarratas' anseo thíos

source: You can register and file your documents such as your annual returns online with CRO using CORE (Companies Online Registration Environment)
ga: Féadfaidh tú doiciméid leat, ar nós do chuid tuairisceán bliantúil, a chlárú agus a chomhdú ar-líne leis an OCC ach úsáid a bhaint as CORE (Companies Online Registration Environment - Timpeallacht Cláraithe Ar-Líne do Chuideachtaí)

source: You can contact your Local Enterprise Office to find out the supports available for setting up a business in Ireland - see 'Where to apply' below
ga: Féadfaidh tu dul i dteagmháil le d'Oifig Fiontair Áitiúil chun fáil amach na tacaíochtaí maidir le gnó a chur ar bun in Éirinn – féach ‘Cá háit a ndéanfaidh mé iarratas' anseo thíos

source: You can find out about registering for tax from your tax office – see ‘Where to apply’ below
ga: Féadfaidh tú fáil amach faoi mar is féidir clárú don cháin ó d'oifig cánach áitiúil – féach ‘Cá háit a ndéanfaidh mé iarratas' anseo thíos
